/***************************Copyright BestFu ***********************************
**  文    件：  TIMx.c
**  功    能：  <<驱动层>> 通用定时器驱动 STM32L151 TIM2/TIM3/TIM4/TIM5
**  编    译：  Keil uVision5 V5.10
**  芯    片：  STM32L151
**  版    本：  V1.0
**  编    写：  Seven
**  创建日期：  2014.08.20
**  修改日期：  2014.08.20
**  说    明：  
**  V1.0
    >> 
*******************************************************************************/
#include "sys.h"
#include "TIMx.h"
#include "key.h"

/*******************************************************************************
**函    数:  void TIMx_Init(TIM_TypeDef *TIMx , u16 psc , u16 arr)
**功    能:  通用定时器TIM2/TIM3/TIM4/TIM5 初始化
**参    数:  *TIMx    -- TIM2/TIM3/TIM4/TIM5
**           psc     -- 预分频值
**           arr     -- 自动重装值
**返    回:  null
**说    明： Init_TIMx(TIM2,31,Count);   //32Mhz  1us分频单位 默认向上计数           
********************************************************************************/
void TIMx_Init(TIM_TypeDef *TIMx , u16 psc , u16 arr)
{
    RCC->APB1ENR |= (1u << ((u32)TIMx - TIM2_BASE)/(0x0400)); 

    TIMx->ARR  = arr;           //自动重装值
    TIMx->PSC  = psc;           //预分配器    CK_CNT = fck_psc/(psc+ 1) = 32M/(psc+1)   
    TIMx->CR2 &= ~(0xF<<4);     //清主模式
    TIMx->CR2 |= 4 << 4;        
    TIMx->DIER|= 1 << 0;		//使能中断  
    TIMx->CNT  = 0;             //清计数器  
    TIMx->CR1 |= 1 << 0;        //使能定时器 
	
	MY_NVIC_Init(2,3,TIM2_IRQn,2);  
}

/******************************************************************************
**函    数: TIM2_IRQHandler
**功    能: 中断服务程序
******************************************************************************/
void TIM2_IRQHandler(void)
{   
    if(TIM2->SR&0X0001)
    {   
		KeyStateScan();
    }                  
    TIM2->SR&=~(1<<0);
}

/********************************* END FILE ***********************************/
