/***************************Copyright BestFu ***********************************
**  文    件：  74HC595.c
**  功    能：  <<驱动层>> 串转并74HC595驱动
**  编    译：  Keil uVision5 V5.10
**  版    本：  V1.0
**  编    写：  Seven
**  创建日期：  2014.08.22
**  修改日期：  2014.08.25
**  说    明：  
*******************************************************************************/
#include "74HC595.h"
#include "delay.h"

/*******************************************************************************
**函    数： _74HC595_Init
**功    能： 初始化相关IO管脚
**参    数： void
**返    回： void
*******************************************************************************/
void _74HC595_Init(void)
{
    GPIOx_Cfg(PORT_LED_ON_OFF,  PIN_LED_ON_OFF,    OUT_PP_2M);
    GPIOx_Cfg(PORT_595_SDI,  PIN_595_SDI,    OUT_PP_2M);
    GPIOx_Cfg(PORT_595_SHCP, PIN_595_SHCP,   OUT_PP_2M);
    GPIOx_Cfg(PORT_595_STCP, PIN_595_STCP,   OUT_PP_2M);
    GPIOx_Cfg(PORT_595_OE,   PIN_595_OE,     OUT_PP_2M);
    GPIOx_Cfg(PORT_595_MR,   PIN_595_MR,     OUT_PP_2M);

    GPIOx_Set(PORT_LED_ON_OFF,  PIN_LED_ON_OFF);        //开启电路电源
 
    HC595_SDI(0);
    HC595_SHCP(0);
    HC595_STCP(0);
    HC595_MR(0);            //清除寄存器值
    HC595_OE(1);            //高阻抗，关闭所有LED
    delay_us(10);
    HC595_MR(1);    
    HC595_STCP(1);
}

/*******************************************************************************
**函    数： _74HC595_MainReset
**功    能： 清除74HC595移位寄存器
**参    数： void
**返    回： void
*******************************************************************************/
void _74HC595_MainReset(void)
{
    HC595_STCP(0);
    HC595_MR(0);
    delay_us(1);
    HC595_MR(1);
    HC595_STCP(1);
}

/*******************************************************************************
**函    数： _74HC595_WriteData
**功    能： 74HC595写16位数据
**参    数： data      -- 表示595级联的16个IO输出。data的第15位驱动第16个LED灯，data的第0位驱动第1个LED灯
**返    回： void
**说    明： 如LED=0x4001,    表示点亮第14个和第1个LED灯 
*******************************************************************************/
void _74HC595_WriteData(u16 data)
{
    u8 i;

    HC595_STCP(0);          //输出状态寄存器保持
    for(i=16 ; i>0 ; i--)
    {
        HC595_SHCP(0);
        if(data & 0x8000)       HC595_SDI(1);
        else                    HC595_SDI(0);    
        HC595_SHCP(1);
        data<<=1;
    }
    HC595_STCP(1);          //将移位寄存器的值锁存到输出寄存器中
    HC595_OE(0);            //输出有效，点亮LED灯
}


/********************************* END FILE ***********************************/
